MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6010/mcu.h
#define _PTMR_PTMR7_POSITION                     0x00000007
#define _PTMR_PTMR7_MASK                         0x00000080
#define _PTMR_PTMR7_LENGTH                       0x00000001

#define _PTMR_PTMR8_POSITION                     0x00000008
#define _PTMR_PTMR8_MASK                         0x00000100
#define _PTMR_PTMR8_LENGTH                       0x00000001

#define _PTMR_PTMR9_POSITION                     0x00000009
#define _PTMR_PTMR9_MASK                         0x00000200
#define _PTMR_PTMR9_LENGTH                       0x00000001

#define _PTMR_PTMR10_POSITION                    0x0000000A
#define _PTMR_PTMR10_MASK                        0x00000400
#define _PTMR_PTMR10_LENGTH                      0x00000001

#define _PTMR_PTMR11_POSITION                    0x0000000B
#define _PTMR_PTMR11_MASK                        0x00000800
#define _PTMR_PTMR11_LENGTH                      0x00000001

#define _PTMR_PTMR12_POSITION                    0x0000000C
#define _PTMR_PTMR12_MASK                        0x00001000
#define _PTMR_PTMR12_LENGTH                      0x00000001

#define _PTMR_PTMR13_POSITION                    0x0000000D
#define _PTMR_PTMR13_MASK                        0x00002000
#define _PTMR_PTMR13_LENGTH                      0x00000001

#define _PTMR_PTMR14_POSITION                    0x0000000E
#define _PTMR_PTMR14_MASK                        0x00004000
#define _PTMR_PTMR14_LENGTH                      0x00000001

#define _PTPER_PTPER_POSITION                    0x00000000
#define _PTPER_PTPER_MASK                        0x00007FFF
#define _PTPER_PTPER_LENGTH                      0x0000000F

#define _SEVTCMP_SEVTCMP_POSITION                0x00000000
#define _SEVTCMP_SEVTCMP_MASK                    0x00007FFF
#define _SEVTCMP_SEVTCMP_LENGTH                  0x0000000F

#define _SEVTCMP_SEVTDIR_POSITION                0x0000000F
#define _SEVTCMP_SEVTDIR_MASK                    0x00008000
#define _SEVTCMP_SEVTDIR_LENGTH                  0x00000001

#define _SEVTCMP_SEVTCMP0_POSITION               0x00000000
#define _SEVTCMP_SEVTCMP0_MASK                   0x00000001
#define _SEVTCMP_SEVTCMP0_LENGTH                 0x00000001

#define _SEVTCMP_SEVTCMP1_POSITION               0x00000001
#define _SEVTCMP_SEVTCMP1_MASK                   0x00000002
#define _SEVTCMP_SEVTCMP1_LENGTH                 0x00000001

#define _SEVTCMP_SEVTCMP2_POSITION               0x00000002
#define _SEVTCMP_SEVTCMP2_MASK                   0x00000004
#define _SEVTCMP_SEVTCMP2_LENGTH                 0x00000001

#define _SEVTCMP_SEVTCMP3_POSITION               0x00000003
#define _SEVTCMP_SEVTCMP3_MASK                   0x00000008
#define _SEVTCMP_SEVTCMP3_LENGTH                 0x00000001

#define _SEVTCMP_SEVTCMP4_POSITION               0x00000004
#define _SEVTCMP_SEVTCMP4_MASK                   0x00000010
#define _SEVTCMP_SEVTCMP4_LENGTH                 0x00000001

#define _SEVTCMP_SEVTCMP5_POSITION               0x00000005
#define _SEVTCMP_SEVTCMP5_MASK                   0x00000020
#define _SEVTCMP_SEVTCMP5_LENGTH                 0x00000001

#define _SEVTCMP_SEVTCMP6_POSITION               0x00000006
#define _SEVTCMP_SEVTCMP6_MASK                   0x00000040
#define _SEVTCMP_SEVTCMP6_LENGTH                 0x00000001

#define _SEVTCMP_SEVTCMP7_POSITION               0x00000007
#define _SEVTCMP_SEVTCMP7_MASK                   0x00000080
#define _SEVTCMP_SEVTCMP7_LENGTH                 0x00000001

#define _SEVTCMP_SEVTCMP8_POSITION               0x00000008
#define _SEVTCMP_SEVTCMP8_MASK                   0x00000100
#define _SEVTCMP_SEVTCMP8_LENGTH                 0x00000001

#define _SEVTCMP_SEVTCMP9_POSITION               0x00000009
#define _SEVTCMP_SEVTCMP9_MASK                   0x00000200
#define _SEVTCMP_SEVTCMP9_LENGTH                 0x00000001

#define _SEVTCMP_SEVTCMP10_POSITION              0x0000000A
#define _SEVTCMP_SEVTCMP10_MASK                  0x00000400
#define _SEVTCMP_SEVTCMP10_LENGTH                0x00000001

#define _SEVTCMP_SEVTCMP11_POSITION              0x0000000B
#define _SEVTCMP_SEVTCMP11_MASK                  0x00000800
#define _SEVTCMP_SEVTCMP11_LENGTH                0x00000001

#define _SEVTCMP_SEVTCMP12_POSITION              0x0000000C
#define _SEVTCMP_SEVTCMP12_MASK                  0x00001000
#define _SEVTCMP_SEVTCMP12_LENGTH                0x00000001

#define _SEVTCMP_SEVTCMP13_POSITION              0x0000000D
#define _SEVTCMP_SEVTCMP13_MASK                  0x00002000
#define _SEVTCMP_SEVTCMP13_LENGTH                0x00000001

#define _SEVTCMP_SEVTCMP14_POSITION              0x0000000E
#define _SEVTCMP_SEVTCMP14_MASK                  0x00004000
#define _SEVTCMP_SEVTCMP14_LENGTH                0x00000001

#define _PWMCON1_PEN1L_POSITION                  0x00000000
#define _PWMCON1_PEN1L_MASK                      0x00000001
#define _PWMCON1_PEN1L_LENGTH                    0x00000001

#define _PWMCON1_PEN2L_POSITION                  0x00000001
#define _PWMCON1_PEN2L_MASK                      0x00000002
#define _PWMCON1_PEN2L_LENGTH                    0x00000001

#define _PWMCON1_PEN3L_POSITION                  0x00000002
#define _PWMCON1_PEN3L_MASK                      0x00000004
#define _PWMCON1_PEN3L_LENGTH                    0x00000001

#define _PWMCON1_PEN4L_POSITION                  0x00000003
#define _PWMCON1_PEN4L_MASK                      0x00000008
#define _PWMCON1_PEN4L_LENGTH                    0x00000001

#define _PWMCON1_PEN1H_POSITION                  0x00000004
#define _PWMCON1_PEN1H_MASK                      0x00000010
#define _PWMCON1_PEN1H_LENGTH                    0x00000001

#define _PWMCON1_PEN2H_POSITION                  0x00000005
#define _PWMCON1_PEN2H_MASK                      0x00000020
#define _PWMCON1_PEN2H_LENGTH                    0x00000001

#define _PWMCON1_PEN3H_POSITION                  0x00000006
#define _PWMCON1_PEN3H_MASK                      0x00000040
#define _PWMCON1_PEN3H_LENGTH                    0x00000001

#define _PWMCON1_PEN4H_POSITION                  0x00000007
#define _PWMCON1_PEN4H_MASK                      0x00000080
#define _PWMCON1_PEN4H_LENGTH                    0x00000001

#define _PWMCON1_PTMOD1_POSITION                 0x00000008
#define _PWMCON1_PTMOD1_MASK                     0x00000100
#define _PWMCON1_PTMOD1_LENGTH                   0x00000001

