MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6010/mcu.h
#define _DTCON2_DTS3I_POSITION                   0x00000004
#define _DTCON2_DTS3I_MASK                       0x00000010
#define _DTCON2_DTS3I_LENGTH                     0x00000001

#define _DTCON2_DTS3A_POSITION                   0x00000005
#define _DTCON2_DTS3A_MASK                       0x00000020
#define _DTCON2_DTS3A_LENGTH                     0x00000001

#define _DTCON2_DTS4I_POSITION                   0x00000006
#define _DTCON2_DTS4I_MASK                       0x00000040
#define _DTCON2_DTS4I_LENGTH                     0x00000001

#define _DTCON2_DTS4A_POSITION                   0x00000007
#define _DTCON2_DTS4A_MASK                       0x00000080
#define _DTCON2_DTS4A_LENGTH                     0x00000001

#define _FLTACON_FAEN1_POSITION                  0x00000000
#define _FLTACON_FAEN1_MASK                      0x00000001
#define _FLTACON_FAEN1_LENGTH                    0x00000001

#define _FLTACON_FAEN2_POSITION                  0x00000001
#define _FLTACON_FAEN2_MASK                      0x00000002
#define _FLTACON_FAEN2_LENGTH                    0x00000001

#define _FLTACON_FAEN3_POSITION                  0x00000002
#define _FLTACON_FAEN3_MASK                      0x00000004
#define _FLTACON_FAEN3_LENGTH                    0x00000001

#define _FLTACON_FAEN4_POSITION                  0x00000003
#define _FLTACON_FAEN4_MASK                      0x00000008
#define _FLTACON_FAEN4_LENGTH                    0x00000001

#define _FLTACON_FLTAM_POSITION                  0x00000007
#define _FLTACON_FLTAM_MASK                      0x00000080
#define _FLTACON_FLTAM_LENGTH                    0x00000001

#define _FLTACON_FAOV1L_POSITION                 0x00000008
#define _FLTACON_FAOV1L_MASK                     0x00000100
#define _FLTACON_FAOV1L_LENGTH                   0x00000001

#define _FLTACON_FAOV1H_POSITION                 0x00000009
#define _FLTACON_FAOV1H_MASK                     0x00000200
#define _FLTACON_FAOV1H_LENGTH                   0x00000001

#define _FLTACON_FAOV2L_POSITION                 0x0000000A
#define _FLTACON_FAOV2L_MASK                     0x00000400
#define _FLTACON_FAOV2L_LENGTH                   0x00000001

#define _FLTACON_FAOV2H_POSITION                 0x0000000B
#define _FLTACON_FAOV2H_MASK                     0x00000800
#define _FLTACON_FAOV2H_LENGTH                   0x00000001

#define _FLTACON_FAOV3L_POSITION                 0x0000000C
#define _FLTACON_FAOV3L_MASK                     0x00001000
#define _FLTACON_FAOV3L_LENGTH                   0x00000001

#define _FLTACON_FAOV3H_POSITION                 0x0000000D
#define _FLTACON_FAOV3H_MASK                     0x00002000
#define _FLTACON_FAOV3H_LENGTH                   0x00000001

#define _FLTACON_FAOV4L_POSITION                 0x0000000E
#define _FLTACON_FAOV4L_MASK                     0x00004000
#define _FLTACON_FAOV4L_LENGTH                   0x00000001

#define _FLTACON_FAOV4H_POSITION                 0x0000000F
#define _FLTACON_FAOV4H_MASK                     0x00008000
#define _FLTACON_FAOV4H_LENGTH                   0x00000001

#define _FLTBCON_FBEN1_POSITION                  0x00000000
#define _FLTBCON_FBEN1_MASK                      0x00000001
#define _FLTBCON_FBEN1_LENGTH                    0x00000001

#define _FLTBCON_FBEN2_POSITION                  0x00000001
#define _FLTBCON_FBEN2_MASK                      0x00000002
#define _FLTBCON_FBEN2_LENGTH                    0x00000001

#define _FLTBCON_FBEN3_POSITION                  0x00000002
#define _FLTBCON_FBEN3_MASK                      0x00000004
#define _FLTBCON_FBEN3_LENGTH                    0x00000001

#define _FLTBCON_FBEN4_POSITION                  0x00000003
#define _FLTBCON_FBEN4_MASK                      0x00000008
#define _FLTBCON_FBEN4_LENGTH                    0x00000001

#define _FLTBCON_FLTBM_POSITION                  0x00000007
#define _FLTBCON_FLTBM_MASK                      0x00000080
#define _FLTBCON_FLTBM_LENGTH                    0x00000001

#define _FLTBCON_FBOV1L_POSITION                 0x00000008
#define _FLTBCON_FBOV1L_MASK                     0x00000100
#define _FLTBCON_FBOV1L_LENGTH                   0x00000001

#define _FLTBCON_FBOV1H_POSITION                 0x00000009
#define _FLTBCON_FBOV1H_MASK                     0x00000200
#define _FLTBCON_FBOV1H_LENGTH                   0x00000001

#define _FLTBCON_FBOV2L_POSITION                 0x0000000A
#define _FLTBCON_FBOV2L_MASK                     0x00000400
#define _FLTBCON_FBOV2L_LENGTH                   0x00000001

#define _FLTBCON_FBOV2H_POSITION                 0x0000000B
#define _FLTBCON_FBOV2H_MASK                     0x00000800
#define _FLTBCON_FBOV2H_LENGTH                   0x00000001

#define _FLTBCON_FBOV3L_POSITION                 0x0000000C
#define _FLTBCON_FBOV3L_MASK                     0x00001000
#define _FLTBCON_FBOV3L_LENGTH                   0x00000001

#define _FLTBCON_FBOV3H_POSITION                 0x0000000D
#define _FLTBCON_FBOV3H_MASK                     0x00002000
#define _FLTBCON_FBOV3H_LENGTH                   0x00000001

#define _FLTBCON_FBOV4L_POSITION                 0x0000000E
#define _FLTBCON_FBOV4L_MASK                     0x00004000
#define _FLTBCON_FBOV4L_LENGTH                   0x00000001

#define _FLTBCON_FBOV4H_POSITION                 0x0000000F
#define _FLTBCON_FBOV4H_MASK                     0x00008000
#define _FLTBCON_FBOV4H_LENGTH                   0x00000001

#define _OVDCON_POUT1L_POSITION                  0x00000000
#define _OVDCON_POUT1L_MASK                      0x00000001
#define _OVDCON_POUT1L_LENGTH                    0x00000001

#define _OVDCON_POUT1H_POSITION                  0x00000001
#define _OVDCON_POUT1H_MASK                      0x00000002
#define _OVDCON_POUT1H_LENGTH                    0x00000001

#define _OVDCON_POUT2L_POSITION                  0x00000002
#define _OVDCON_POUT2L_MASK                      0x00000004
#define _OVDCON_POUT2L_LENGTH                    0x00000001

#define _OVDCON_POUT2H_POSITION                  0x00000003
#define _OVDCON_POUT2H_MASK                      0x00000008
#define _OVDCON_POUT2H_LENGTH                    0x00000001

