MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6010/mcu.h
#define _C2TX0CON_TXLARB_POSITION                0x00000005
#define _C2TX0CON_TXLARB_MASK                    0x00000020
#define _C2TX0CON_TXLARB_LENGTH                  0x00000001

#define _C2TX0CON_TXABT_POSITION                 0x00000006
#define _C2TX0CON_TXABT_MASK                     0x00000040
#define _C2TX0CON_TXABT_LENGTH                   0x00000001

#define _C2TX0CON_TXPRI0_POSITION                0x00000000
#define _C2TX0CON_TXPRI0_MASK                    0x00000001
#define _C2TX0CON_TXPRI0_LENGTH                  0x00000001

#define _C2TX0CON_TXPRI1_POSITION                0x00000001
#define _C2TX0CON_TXPRI1_MASK                    0x00000002
#define _C2TX0CON_TXPRI1_LENGTH                  0x00000001

#define _C2RX1SID_RXIDE_POSITION                 0x00000000
#define _C2RX1SID_RXIDE_MASK                     0x00000001
#define _C2RX1SID_RXIDE_LENGTH                   0x00000001

#define _C2RX1SID_SRR_POSITION                   0x00000001
#define _C2RX1SID_SRR_MASK                       0x00000002
#define _C2RX1SID_SRR_LENGTH                     0x00000001

#define _C2RX1SID_SID0_POSITION                  0x00000002
#define _C2RX1SID_SID0_MASK                      0x00000004
#define _C2RX1SID_SID0_LENGTH                    0x00000001

#define _C2RX1SID_SID1_POSITION                  0x00000003
#define _C2RX1SID_SID1_MASK                      0x00000008
#define _C2RX1SID_SID1_LENGTH                    0x00000001

#define _C2RX1SID_SID2_POSITION                  0x00000004
#define _C2RX1SID_SID2_MASK                      0x00000010
#define _C2RX1SID_SID2_LENGTH                    0x00000001

#define _C2RX1SID_SID3_POSITION                  0x00000005
#define _C2RX1SID_SID3_MASK                      0x00000020
#define _C2RX1SID_SID3_LENGTH                    0x00000001

#define _C2RX1SID_SID4_POSITION                  0x00000006
#define _C2RX1SID_SID4_MASK                      0x00000040
#define _C2RX1SID_SID4_LENGTH                    0x00000001

#define _C2RX1SID_SID5_POSITION                  0x00000007
#define _C2RX1SID_SID5_MASK                      0x00000080
#define _C2RX1SID_SID5_LENGTH                    0x00000001

#define _C2RX1SID_SID6_POSITION                  0x00000008
#define _C2RX1SID_SID6_MASK                      0x00000100
#define _C2RX1SID_SID6_LENGTH                    0x00000001

#define _C2RX1SID_SID7_POSITION                  0x00000009
#define _C2RX1SID_SID7_MASK                      0x00000200
#define _C2RX1SID_SID7_LENGTH                    0x00000001

#define _C2RX1SID_SID8_POSITION                  0x0000000A
#define _C2RX1SID_SID8_MASK                      0x00000400
#define _C2RX1SID_SID8_LENGTH                    0x00000001

#define _C2RX1SID_SID9_POSITION                  0x0000000B
#define _C2RX1SID_SID9_MASK                      0x00000800
#define _C2RX1SID_SID9_LENGTH                    0x00000001

#define _C2RX1SID_SID10_POSITION                 0x0000000C
#define _C2RX1SID_SID10_MASK                     0x00001000
#define _C2RX1SID_SID10_LENGTH                   0x00000001

#define _C2RX1SID_SID_POSITION                   0x00000002
#define _C2RX1SID_SID_MASK                       0x00001FFC
#define _C2RX1SID_SID_LENGTH                     0x0000000B

#define _C2RX1EID_EID6_POSITION                  0x00000000
#define _C2RX1EID_EID6_MASK                      0x00000001
#define _C2RX1EID_EID6_LENGTH                    0x00000001

#define _C2RX1EID_EID7_POSITION                  0x00000001
#define _C2RX1EID_EID7_MASK                      0x00000002
#define _C2RX1EID_EID7_LENGTH                    0x00000001

#define _C2RX1EID_EID8_POSITION                  0x00000002
#define _C2RX1EID_EID8_MASK                      0x00000004
#define _C2RX1EID_EID8_LENGTH                    0x00000001

#define _C2RX1EID_EID9_POSITION                  0x00000003
#define _C2RX1EID_EID9_MASK                      0x00000008
#define _C2RX1EID_EID9_LENGTH                    0x00000001

#define _C2RX1EID_EID10_POSITION                 0x00000004
#define _C2RX1EID_EID10_MASK                     0x00000010
#define _C2RX1EID_EID10_LENGTH                   0x00000001

#define _C2RX1EID_EID11_POSITION                 0x00000005
#define _C2RX1EID_EID11_MASK                     0x00000020
#define _C2RX1EID_EID11_LENGTH                   0x00000001

#define _C2RX1EID_EID12_POSITION                 0x00000006
#define _C2RX1EID_EID12_MASK                     0x00000040
#define _C2RX1EID_EID12_LENGTH                   0x00000001

#define _C2RX1EID_EID13_POSITION                 0x00000007
#define _C2RX1EID_EID13_MASK                     0x00000080
#define _C2RX1EID_EID13_LENGTH                   0x00000001

#define _C2RX1EID_EID14_POSITION                 0x00000008
#define _C2RX1EID_EID14_MASK                     0x00000100
#define _C2RX1EID_EID14_LENGTH                   0x00000001

#define _C2RX1EID_EID15_POSITION                 0x00000009
#define _C2RX1EID_EID15_MASK                     0x00000200
#define _C2RX1EID_EID15_LENGTH                   0x00000001

#define _C2RX1EID_EID16_POSITION                 0x0000000A
#define _C2RX1EID_EID16_MASK                     0x00000400
#define _C2RX1EID_EID16_LENGTH                   0x00000001

#define _C2RX1EID_EID17_POSITION                 0x0000000B
#define _C2RX1EID_EID17_MASK                     0x00000800
#define _C2RX1EID_EID17_LENGTH                   0x00000001

#define _C2RX1DLC_DLC_POSITION                   0x00000000
#define _C2RX1DLC_DLC_MASK                       0x0000000F
#define _C2RX1DLC_DLC_LENGTH                     0x00000004

#define _C2RX1DLC_RXRB0_POSITION                 0x00000004
#define _C2RX1DLC_RXRB0_MASK                     0x00000010
#define _C2RX1DLC_RXRB0_LENGTH                   0x00000001

#define _C2RX1DLC_RXRB1_POSITION                 0x00000008
#define _C2RX1DLC_RXRB1_MASK                     0x00000100
#define _C2RX1DLC_RXRB1_LENGTH                   0x00000001

#define _C2RX1DLC_RXRTR_POSITION                 0x00000009
#define _C2RX1DLC_RXRTR_MASK                     0x00000200
#define _C2RX1DLC_RXRTR_LENGTH                   0x00000001

#define _C2RX1DLC_EID0_POSITION                  0x0000000A
#define _C2RX1DLC_EID0_MASK                      0x00000400
#define _C2RX1DLC_EID0_LENGTH                    0x00000001

#define _C2RX1DLC_EID1_POSITION                  0x0000000B
#define _C2RX1DLC_EID1_MASK                      0x00000800
#define _C2RX1DLC_EID1_LENGTH                    0x00000001

#define _C2RX1DLC_EID2_POSITION                  0x0000000C
#define _C2RX1DLC_EID2_MASK                      0x00001000
#define _C2RX1DLC_EID2_LENGTH                    0x00000001

#define _C2RX1DLC_EID3_POSITION                  0x0000000D
#define _C2RX1DLC_EID3_MASK                      0x00002000
#define _C2RX1DLC_EID3_LENGTH                    0x00000001

#define _C2RX1DLC_EID4_POSITION                  0x0000000E
#define _C2RX1DLC_EID4_MASK                      0x00004000
#define _C2RX1DLC_EID4_LENGTH                    0x00000001

#define _C2RX1DLC_EID5_POSITION                  0x0000000F
#define _C2RX1DLC_EID5_MASK                      0x00008000
#define _C2RX1DLC_EID5_LENGTH                    0x00000001

